Documents/бит_РегистрацияПроживающихПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_РегистрацияПроживающихПоЛС</Name>
			<BasedOn>
				<xr:Item>Document.бит_ЗаявлениеОРегистрацииПоМестуПЖ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ПроживающиеПоЛС</xr:Item>
				<xr:Item>InformationRegister.бит_ОтветственныеЛицаПоКУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ЗаявлениеОРегистрацииПоМестуПЖ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокПроживающих</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВладелецКвартиры</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПрибытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСнятияСРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПраваСобственности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляПлощади</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КудаВыписан</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КудаВыписанАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткудаПрибыл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткудаПрибылАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравоустанавливающиеДокументы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаВыписки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПрописки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусПроживания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусФизЛица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусФизЛицаДляИзменения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>лб_ДоляПлощадиСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>лб_СтрокаРодствДляФЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>лб_СтатусСтрокиДляФЛС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.лб_ОсобенностиСтрокиРегистрации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>бит_ПомещенВАрхив</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ОтветственныеЛицаПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ОтветственныеЛицаПоКУ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_СтатусПроживания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_СтатусПроживания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постоянно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Временно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПроживает</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_РегистрацияПроживающихПоЛС/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.
#КонецОбласти
Перем мТаблицаСобственников;   //
Перем мДатаСобственности;


#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , "");
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++АнисимоваМВ 1бит 11.11.2024 восстановление после сбоя вывод дополнительных полей
	//Эл = Элементы.Вставить("ОставитьОтвественногоНаЛС", Тип("ПолеФормы"), Элементы.СписокПроживающих, Элементы.СписокПроживающихГруппа5);    
	//Эл.Вид = ВидПоляФормы.ПолеВвода;
	//Эл.ПутьКДанным = "Объект.СписокПроживающих.лб_СтатусСтрокиДляФЛС";
	//Эл.Заголовок = "Статус строки для ФЛС";
	//
	//Эл = Элементы.Вставить("лб_ДоляПлощадиСтрокой", Тип("ПолеФормы"), Элементы.СписокПроживающихГруппа3, Элементы.СписокПроживающихПравоустанавливающиеДокументы);    
	//Эл.Вид = ВидПоляФормы.ПолеВвода;
	//Эл.ПутьКДанным = "Объект.СписокПроживающих.лб_ДоляПлощадиСтрокой";
	//Эл.Заголовок = "Доля строкой (Омск)";

	//Эл = Элементы.Вставить("лб_СтрокаРодствДляФЛС", Тип("ПолеФормы"), Элементы.СписокПроживающихГруппа2, Элементы.СписокПроживающихКонтрагент    );    
	//Эл.Вид = ВидПоляФормы.ПолеВвода;
	//Эл.ПутьКДанным = "Объект.СписокПроживающих.лб_СтрокаРодствДляФЛС";
	//Эл.Заголовок = "в ФЛС выводим:";

	//Эл = Элементы.Вставить("бит_ПомещенВАрхив", Тип("ПолеФормы"), Элементы.СписокПроживающих, Элементы.СписокПроживающихГруппа5);    
	//Эл.Вид = ВидПоляФормы.ПолеВвода;
	//Эл.ПутьКДанным = "Объект.СписокПроживающих.бит_ПомещенВАрхив";
	//Эл.Заголовок = "Помещен в архив";
	//
	//--АнисимоваМВ 1бит 11.11.2024
	// БИТ_ЖКХ_05122013_окончание_изменений
	Если Параметры.Свойство("ЗаполнитьИзСправочникаЛицевыеСчета") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда			
			
			Объект.ЛицевойСчет      = Параметры.ЗаполнитьИзСправочникаЛицевыеСчета.ЛицевойСчет;
			
		КонецЕсли;	
	КонецЕсли;	
	// БИТ_ЖКХ_05122013_окончание_изменений
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// БИТ ЖКХ 08.04.2020 25.06.20
	//если мКэшЗначений.НачислениеСоДняПраваСобственности = ложь тогда 
	 ЭтаФорма.Элементы.СписокПроживающихДатаПраваСобственности.Доступность = ложь;
	//конецесли; 
	
	Если Параметры.Свойство("ЗаполнитьИзДокументаЗаявлениеОРегистрацииПоМестуПЖ") Тогда
		
		Если Параметры.ЗаполнитьИзДокументаЗаявлениеОРегистрацииПоМестуПЖ.ПовтроныйВводНаОсновании Тогда
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
    // БИТ ЖКХ 13.04.2020
	ЗаполнитьТаблицуСобственников();
	
КонецПроцедуры

функция ЗаполнитьТаблицуСобственников(статус = неопределено)
	
	если статус <> неопределено и статус <> Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда
	 возврат неопределено;	
	конецесли;
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛССрезПоследних.Период КАК Период,
	               |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	               |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	               |	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	               |	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	               |	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	               |	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	               |	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	               |	бит_ПроживающиеПоЛССрезПоследних.ДатаПраваСобственности КАК ДатаПраваСобственности
	               |ИЗ
	               |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних КАК бит_ПроживающиеПоЛССрезПоследних
	               |ГДЕ
	               |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет
	               |	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &СтепеньРодства";
	
	запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	запрос.УстановитьПараметр("СтепеньРодства", Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	
	мТаблицаСобственников = запрос.Выполнить().Выгрузить();
	мТаблицаСобственников.Сортировать("Период Убыв");
	если мТаблицаСобственников.Количество() > 0 тогда
	 если мТаблицаСобственников[0].ДатаПраваСобственности <> '00010101000000' тогда	
	  мДатаСобственности = КонецДня(мТаблицаСобственников[0].ДатаПраваСобственности) + 1;
     иначе
	  мДатаСобственности = неопределено;
	 конецесли; 
    иначе
	 мДатаСобственности = Объект.Дата;
    конецесли; 
    возврат мДатаСобственности; 
конецфункции

функция ПроверитьДатуСобственников(ДатаСобственника)
	
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	бит_ПроживающиеПоЛССрезПоследних.Период КАК Период,
	               |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	               |	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	               |	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
	               |	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	               |	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
	               |	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
	               |	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
	               |	бит_ПроживающиеПоЛССрезПоследних.ДатаПраваСобственности КАК ДатаПраваСобственности
	               |ИЗ
	               |	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних КАК бит_ПроживающиеПоЛССрезПоследних
	               |ГДЕ
	               |	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет = &ЛицевойСчет
	               |	И бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = &СтепеньРодства";
	
	запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
	запрос.УстановитьПараметр("СтепеньРодства", Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо);
	
	мТаблицаСобственников = запрос.Выполнить().Выгрузить();
	мТаблицаСобственников.Сортировать("Период Убыв");
	
	если мТаблицаСобственников.Количество() > 0 тогда	   
	  если мТаблицаСобственников[0].ДатаПраваСобственности > ДатаСобственника тогда 
		если мТаблицаСобственников[0].ДатаСнятияСРегистрации = '00010101000000' тогда	
		 возврат ложь; 
		конецесли; 
	  конецесли;		  
    конецесли; 
    возврат истина; 
	
конецфункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПараметрыЖКХ();
	бит_СформироватьСписокДолей(КонецМесяца(Объект.Дата), Объект.ЛицевойСчет);	
	УстановитьЗаголовокФормыДокумента();
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	// БИТ_ЖКХ_25112013_окончание_изменений
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("ИзменениеПроживающихПоЛС", Объект.ЛицевойСчет, );
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_Проживающие") Тогда
			
			Отбор = Новый Структура("ФизЛицо", ВыбранноеЗначение);
			
			СтрокаТабличнойЧасти = Объект.СписокПроживающих.НайтиСтроки(Отбор);
			
			Если СтрокаТабличнойЧасти.Количество() = 0 Тогда
				
				ДобавитьСтрокуВСписокПроживающихНаСервере(ВыбранноеЗначение);	
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИсточникВыбора.ИмяФормы = "Документ.бит_РегистрацияПроживающихПоЛС.Форма.ФормаВыбораИзСпискаПроживающих" Тогда
			
			ДобавитьФизЛицНаСервере(ВыбранноеЗначение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьПараметрыЖКХ" Тогда
		
		ЗаполнитьПараметрыЖКХ();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ПодборИзСправочникаПроживающие(Команда)
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", Новый Структура("ЗакрыватьПриВыборе", Ложь), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборИзСпискаПроживающих(Команда)
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	мСписокЗначений = ПолучитьСписокЗначенийНаСервере(КонецМесяца(Объект.Дата), Объект.ЛицевойСчет);
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Ссылка", мСписокЗначений);
	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", Новый Структура("ЗаполнитьИзДокументаРегистрацияПроживающихПоЛСПодбор", ПараметрыФормы), ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Доли(Команда)
	
	ОткрытьФорму("Документ.бит_РегистрацияПроживающихПоЛС.Форма.ФормаВыбораИзСпискаПроживающих", Новый Структура("Дата, ЛицевойСчет", КонецДня(Объект.Дата), Объект.ЛицевойСчет), ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ПроверитьНомерДокументаНаСервере();
	
	мКэшЗначений.Дата = Объект.Дата;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура СписокПроживающихПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	НоваяСтрока = Объект.СписокПроживающих.Добавить();
	
	НоваяСтрока.СтатусФизЛица    = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация");
	НоваяСтрока.СтепеньРодства   = ПредопределенноеЗначение("Справочник.бит_СтепениРодстваФизЛиц.бит_НеУказано");
	НоваяСтрока.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Постоянно");
	НоваяСтрока.ФизЛицо          = ПредопределенноеЗначение("Справочник.бит_Проживающие.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихФизЛицоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокПроживающих.ТекущиеДанные;
	
	// БИТ_ЖКХ 23.12.2014{{
	// Структура   с данными адреса.
	// АдресУбытия   = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(ТекущиеДанные.ФизЛицо, "Убытия"  , Истина);.
	// АдресПрибытия = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(ТекущиеДанные.ФизЛицо, "Прибытия", Истина);.
	
	АдресПрибытия   = КонтактнаяИнформацияНаСервере(ТекущиеДанные.ФизЛицо, "Прибытия");
	
	АдресУбытия   = КонтактнаяИнформацияНаСервере(ТекущиеДанные.ФизЛицо, "Убытия");
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОткудаПрибылАдрес) и ЗначениеЗаполнено(АдресПрибытия.Адрес) Тогда
		
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ОткудаПрибылАдрес = АдресПрибытия.Адрес;
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ДатаПрибытия = АдресПрибытия.ДатаРегистрации;
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Откуда прибыл адрес взят из " + АдресПрибытия.СсылкаНаЗаявление);
		
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.КудаВыписанАдрес) и ЗначениеЗаполнено(АдресУбытия.Адрес) Тогда
		
		ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.КудаВыписанАдрес 	= АдресУбытия.Адрес;
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Куда выписан адрес взят из " + АдресУбытия.СсылкаНаЗаявление);
		
	КонецЕсли; 
	// БИТ_ЖКХ 23.12.2014}}
	
КонецПроцедуры

// БИТ_ЖКХ 23.12.2014{{
&НаСервере
Функция КонтактнаяИнформацияНаСервере(ФизЛицо,ПрибытияУбытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация.Ссылка,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация.Тип,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация.Вид,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация.Представление,
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.бит_ЗаявлениеОРегистрацииПоМестуПЖ.КонтактнаяИнформация КАК бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация
	|ГДЕ
	|	бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация.Ссылка.РегистрируемоеЛицо = &ФизЛицо
	|	И бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация.Тип = &Тип
	|	И бит_ЗаявлениеОРегистрацииПоМестуПЖКонтактнаяИнформация.Вид = &Вид
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Если ПрибытияУбытия = "Прибытия" Тогда
		Запрос.УстановитьПараметр("Вид"   , ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ОткудаПрибылПредставление"));
	ИначеЕсли ПрибытияУбытия = "Убытия" Тогда
		Запрос.УстановитьПараметр("Вид"   , ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.КудаВыписанПредставление"));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Адрес = ВыборкаДетальныеЗаписи.Представление;
		СсылкаНаЗаявление = ВыборкаДетальныеЗаписи.Ссылка;
		
	Иначе
		
		Если ПрибытияУбытия = "Прибытия" Тогда
			
			Адрес = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(ФизЛицо, "Прибытия", Истина);
			
			Если Строка(ТипЗнч(Адрес)) = "Структура" Тогда
				
				Если Адрес.Свойство("Представление") Тогда
					
					Адрес = Адрес.Представление;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		ИначеЕсли ПрибытияУбытия = "Убытия" Тогда
			Адрес   = бит_ОбщегоНазначения.ПолучитьАдресИзКонтактнойИнформацииФизЛица(ФизЛицо, "Убытия"  , Истина);
			
			Если Строка(ТипЗнч(Адрес)) = "Структура" Тогда
				
				Если Адрес.Свойство("Представление") Тогда
					
					Адрес = Адрес.Представление;
					
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;
		
		СсылкаНаЗаявление = "";
		
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Адрес",Адрес);
	Если ЗначениеЗаполнено(СсылкаНаЗаявление) и ПрибытияУбытия = "Прибытия" Тогда
		Структура.Вставить("ДатаРегистрации",СсылкаНаЗаявление.ДатаРегистрации);
	КонецЕсли;
	Структура.Вставить("СсылкаНаЗаявление",СсылкаНаЗаявление);
	
	Возврат Структура;
	
КонецФункции
// БИТ_ЖКХ 23.12.2014}}

&НаКлиенте
Процедура СписокПроживающихФизЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.бит_Проживающие.Форма.ФормаВыбораУправляемая", Новый Структура("ТекЭлемент", Элементы.СписокПроживающих.ТекущиеДанные.ФизЛицо), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихВладелецКвартирыПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокПроживающих.ТекущиеДанные;
	
	Если ТекДанные.ВладелецКвартиры = ПредопределенноеЗначение("Перечисление.ДаНет.Нет") Тогда
		
		ТекДанные.ДоляПлощади = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихДоляПлощадиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокПроживающих.ТекущиеДанные;
	
	СуммаДолей = РассчитатьСуммуДолейНаСервере(ТекущиеДанные.Физлицо, ТекущиеДанные.ДоляПлощади); 
	
	Если СуммаДолей > 1 Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Суммарная доля площади превышает максимальную (1) на " + Строка(СуммаДолей - 1) + ". Посмотрите список долей, нажав кнопку с рисунком ""Список проживающих и их доли площади"".");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихДатаРегистрацииПриИзменении(Элемент)
	
	Если НачислениеСУчетомДнейПроживания Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	ТекДанные = Элементы.СписокПроживающих.ТекущиеДанные;
	
	Ответ = ПолучитьСтруктуруРегистрации(КонецМесяца(Объект.Дата), Объект.ЛицевойСчет, ТекДанные.ФизЛицо, ТекДанные.ДатаРегистрации, ТекДанные.ДатаРегистрации);
	
	Если Ответ Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Дата регистрации "+ ТекДанные.ФизЛицо+" входит в прошлый период регистрации.");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПричинуИСтатусВыписки() 
	Возврат Новый Структура("Статус, Причина", Справочники.бит_СтатусФизЛица.НайтиПоКоду("00-000002"), Справочники.бит_ПричиныВыписки.НайтиПоКоду(00-000005));
КонецФункции

&НаКлиенте
Процедура СписокПроживающихДатаСнятияСРегистрацииПриИзменении(Элемент)
	
	ТекСтрока = Элементы.СписокПроживающих.ТекущиеДанные;
	ПричинаИСтатусВыписки = ПолучитьПричинуИСтатусВыписки();
	// БИТ_ЖКХ 23.09.2014
	Если ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) Тогда
		
		ТекСтрока.ПричинаВыписки = ПричинаИСтатусВыписки.Причина;
		
	КонецЕсли;
	// БИТ_ЖКХ 23.09.2014
	
	// БИТ_ЖКХ 19.09.2014
	Если ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) И НачалоДня(ТекСтрока.ДатаСнятияСРегистрации) <= НачалоДня(Объект.Дата) Тогда
		
		Если ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) И НачалоДня(ТекСтрока.ДатаСнятияСРегистрации) <= НачалоДня(ТекущаяДата()) Тогда
			
			ТекСтрока.СтатусФизЛица = ПричинаИСтатусВыписки.Статус;
			
			#Если Клиент Тогда
				
				ПоказатьПредупреждение(Новый ОписаниеОповещения("СписокПроживающихДатаСнятияСРегистрацииПриИзмененииЗавершение1", ЭтотОбъект), "Статус физ лица " + ТекСтрока.ФизЛицо + " изменен на ""Удален с лицевого счета""!",,"Изменен статус физ лица");
				
			#КонецЕсли 
			
		КонецЕсли;
		// БИТ_ЖКХ 19.09.2014
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) ИЛИ (ТекСтрока.ДатаСнятияСРегистрации >= ТекущаяДата()
		И ТекСтрока.СтатусФизЛица = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.Выписан")) Тогда
		
		ТекСтрока.СтатусФизЛица = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.ПустаяСсылка");
		
		#Если Клиент Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("СписокПроживающихДатаСнятияСРегистрацииПриИзмененииЗавершение", ЭтотОбъект), "Заполните статус физ лица : " + ТекСтрока.ФизЛицо + "!",,"Изменен статус физ лица");
			
		#КонецЕсли  
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихДатаСнятияСРегистрацииПриИзмененииЗавершение1(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихДатаСнятияСРегистрацииПриИзмененииЗавершение(ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихПричинаПропискиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ВидПричины", ПредопределенноеЗначение("Перечисление.бит_ПричиныВыпискиПрописки.ПричинаПрописки"));
	
	ОткрытьФорму("Справочник.бит_ПричиныВыписки.Форма.ФормаВыбораУправляемая", Новый Структура("ОткрытьИзДокументаРегистрацияПроживающихПоЛС, ТекЗначение", ПараметрыФормы, Элементы.СписокПроживающих.ТекущиеДанные.ПричинаВыписки), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихПричинаВыпискиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ВидПричины", ПредопределенноеЗначение("Перечисление.бит_ПричиныВыпискиПрописки.ПричинаВыписки"));
	
	ОткрытьФорму("Справочник.бит_ПричиныВыписки.Форма.ФормаВыбораУправляемая", Новый Структура("ОткрытьИзДокументаРегистрацияПроживающихПоЛС, ТекЗначение", ПараметрыФормы, Элементы.СписокПроживающих.ТекущиеДанные.ПричинаВыписки), Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// БИТ_ЖКХ Процедура 
//
// Параметры:
//  Параметр1 – Строка.
//
&НаСервере
Процедура ЗаполнитьПараметрыЖКХ()
	
	Результат = Документы.бит_РегистрацияПроживающихПоЛС.ОбновитьПараметрыЖКХ(Объект.Дата, Объект.ЛицевойСчет.Организация);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Результат);
	
КонецПроцедуры // () 

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Дата"                , Объект.Дата);
	
	// БИТ ЖКХ 08.04.2020
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , КонецДня(ТекущаяДата()));
//	Запрос.УстановитьПараметр("Организация", Объект.ЛицевойСчет.Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.НачислениеСоДняПраваСобственности КАК НачислениеСоДняПраваСобственности
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата,) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НачислениеСоДняПраваСобственности = Выборка.НачислениеСоДняПраваСобственности;
	Иначе	
		НачислениеСоДняПраваСобственности = Ложь;
	КонецЕсли;

	КэшированныеЗначения.Вставить("НачислениеСоДняПраваСобственности", НачислениеСоДняПраваСобственности);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

// Процедура <формирование запроса содержащего список проживающих по текущему лицевому счету и их долей площади.
&НаСервере
Процедура бит_СформироватьСписокДолей(Знач Дата, Знач ЛицевойСчет)
	Запрос =  Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.ДоляПлощади
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныеЛицаПоКУСрезПоследних
	|		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет = ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
	|			И ПроживающиеПоЛССрезПоследних.ФизЛицо = ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	Запрос.УстановитьПараметр("Момент",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);
	
	РезультатЗапроса   = Запрос.Выполнить(); 
	ТаблицаДолейФизЛиц = РезультатЗапроса.Выгрузить();
	
	ЗагрузитьТаблицуДолейНаСервере(ТаблицаДолейФизЛиц);
	
КонецПроцедуры //битСформироватьСписокДолей()

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗначенийНаСервере(Знач Дата, Знач ЛицевойСчет);
	
	// Замена указаний типовых объектов на объекты БИТ в тексте модуля.
	РезультатЗапроса = ПолучитьСписокПроживающих(Дата, ЛицевойСчет);
	ТаблицаФизЛиц    = РезультатЗапроса.Выгрузить();
	
	ЗагрузитьТаблицуНаСервере(ТаблицаФизЛиц);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	мСписокЗначений = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл 
		
		мСписокЗначений.Добавить(Выборка.ФизЛицо)
		
	КонецЦикла;
	
	Возврат мСписокЗначений;
	
КонецФункции

// <Описание функции>
//  Получен результат запроса - список проживающих по лицевому счету на дату документа.
// Параметры:
//  <Дата>  - <Дата> - <текущая дата документа>
//  <ЛицевойСчет>  - <СправочникСсылка.бит_ЛицевыеСчета> - <текущий лицевой счет>.
//
// Возвращаемое значение:
//   <РезультатЗапроса.РезультатЗапроса>   - результат запроса для дальнейшего использования.
//
&НаСервере
Функция ПолучитьСписокПроживающих(Знач Дата, Знач ЛицевойСчет)
	
	Запрос =  Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
	|	ОтветственныеЛицаПоКУСрезПоследних.Контрагент,
	|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	ПроживающиеПоЛССрезПоследних.ДоляПлощади,
	|	ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы,
	// БИТ_ЖКХ 14.01.2015{{
	|	ПроживающиеПоЛССрезПоследних.КудаВыписан,
	|	ПроживающиеПоЛССрезПоследних.ОткудаПрибыл
	// БИТ_ЖКХ 14.01.2015}}
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиеПоЛССрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ОтветственныеЛицаПоКУ.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ОтветственныеЛицаПоКУСрезПоследних
	|		ПО ПроживающиеПоЛССрезПоследних.ЛицевойСчет = ОтветственныеЛицаПоКУСрезПоследних.ЛицевойСчет
	|			И ПроживающиеПоЛССрезПоследних.ФизЛицо = ОтветственныеЛицаПоКУСрезПоследних.ФизЛицо
	|ГДЕ
	|	(ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"     , Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат РезультатЗапроса;	
	
КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруРегистрации(Знач Дата, Знач ЛицевойСчет, Знач ФизЛицо, Знач ДатаРегистрации, Знач ДатаСнятияСРегистрации)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
	|			&КонецПериода,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И ФизЛицо = &ФизЛицо) КАК бит_ПроживающиеПоЛССрезПоследних";
	
	Запрос.УстановитьПараметр("КонецПериода", Дата);
	Запрос.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет);
	Запрос.УстановитьПараметр("ФизЛицо"     , ФизЛицо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Ответ = Ложь;
	
	Если Выборка.Следующий() Тогда
		
		Если ДатаРегистрации < Выборка.ДатаСнятияСРегистрации ИЛИ ДатаРегистрации > Выборка.ДатаРегистрации Тогда
			
			Ответ = Истина;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Ответ;
	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокуВСписокПроживающихНаСервере(ВыбранноеЗначение)
	
	Если Не мТаблицаФизЛиц.Количество() = 0 Тогда
		
		Отбор = Новый Структура("ФизЛицо", ВыбранноеЗначение);
		
		ТаблицаФизЛиц = РеквизитФормыВЗначение("мТаблицаФизЛиц");
		
		НайденнаяСтрока = ТаблицаФизЛиц.НайтиСтроки(Отбор);	 
		
		Если НайденнаяСтрока.Количество() = 0 тогда
			
			НоваяСтрока = Объект.СписокПроживающих.Добавить();
			
			НоваяСтрока.ФизЛицо = ВыбранноеЗначение;
			
			// БИТ_ЖКХ 02.09.2014	
			НоваяСтрока.СтатусФизЛица    = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация");
			НоваяСтрока.СтепеньРодства   = ПредопределенноеЗначение("Справочник.бит_СтепениРодстваФизЛиц.бит_НеУказано");
			НоваяСтрока.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Постоянно");
			// БИТ_ЖКХ 02.09.2014	
			
		Иначе
			
			НоваяСтрока = Объект.СписокПроживающих.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока[0]);
			
			// БИТ_ЖКХ 14.01.2015{{
			НоваяСтрока.КудаВыписанАдрес = НайденнаяСтрока[0].КудаВыписан;                   	
			НоваяСтрока.ОткудаПрибылАдрес = НайденнаяСтрока[0].ОткудаПрибыл;
			// БИТ_ЖКХ 14.01.2015}}
			
		КонецЕсли;
		
	Иначе
		
		НоваяСтрока = Объект.СписокПроживающих.Добавить();
		
		НоваяСтрока.ФизЛицо          = ВыбранноеЗначение;
		НоваяСтрока.СтатусФизЛица    = ПредопределенноеЗначение("Справочник.бит_СтатусФизЛица.ПостояннаяРегистрация");
		НоваяСтрока.СтепеньРодства   = ПредопределенноеЗначение("Справочник.бит_СтепениРодстваФизЛиц.бит_НеУказано");
		НоваяСтрока.СтатусПроживания = ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Постоянно");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуНаСервере(ТаблицаФизЛиц)
	
	СтараяТаблица = РеквизитФормыВЗначение("мТаблицаФизЛиц");
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаФизЛиц.Колонки Цикл
		
		Если СтараяТаблица.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "мТаблицаФизЛиц"));
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	ЗначениеВРеквизитФормы(ТаблицаФизЛиц, "мТаблицаФизЛиц");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуДолейНаСервере(ТаблицаДолейФизЛиц)
	
	СтараяТаблица = РеквизитФормыВЗначение("мТаблицаФизЛицДолей");
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаДолейФизЛиц.Колонки Цикл
		
		Если СтараяТаблица.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
			
			МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "мТаблицаФизЛицДолей"));
			
		КонецЕсли;
		
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	ЗначениеВРеквизитФормы(ТаблицаДолейФизЛиц, "мТаблицаФизЛицДолей");
	
КонецПроцедуры

&НаСервере
Функция РассчитатьСуммуДолейНаСервере(Знач Физлицо, Знач ДоляПлощади)
	
	Отбор = Новый Структура("ФизЛицо", Физлицо);
	
	ТаблицаФизЛицДолей = РеквизитФормыВЗначение("мТаблицаФизЛицДолей");
	
	СтрокаПоиска = ТаблицаФизЛицДолей.НайтиСтроки(Отбор);
	
	Если СтрокаПоиска.Количество() <>  0 Тогда
		
		ТекДоля = СтрокаПоиска[0].ДоляПлощади;
		
		ТаблицаФизЛицДолей.Удалить(СтрокаПоиска[0]);
		
		СуммаДолей = ТаблицаФизЛицДолей.Итог("ДоляПлощади") + ДоляПлощади;
		
		НоваяСтрока = ТаблицаФизЛицДолей.Добавить();
		
		НоваяСтрока.ФизЛицо     = Физлицо;
		НоваяСтрока.ДоляПлощади = ДоляПлощади;
		
	Иначе
		
		СуммаДолей = ТаблицаФизЛицДолей.Итог("ДоляПлощади") + ДоляПлощади;
		
		НоваяСтрока = ТаблицаФизЛицДолей.Добавить();
		
		НоваяСтрока.ФизЛицо     = Физлицо;
		НоваяСтрока.ДоляПлощади = ДоляПлощади;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ТаблицаФизЛицДолей,"мТаблицаФизЛицДолей");
	
	Возврат СуммаДолей;
	
КонецФункции

&НаСервере
Процедура ДобавитьФизЛицНаСервере(ВыбранноеЗначение)
	
	Отбор = Новый Структура;
	
	ТаблицаФизЛицДолей = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресФизЛицВХранилище);
	
	Для каждого ЭлементМассива Из ТаблицаФизЛицДолей Цикл
		
		Отбор = Новый Структура("ФизЛицо", ЭлементМассива);
		
		СтрокаТабличнойЧасти = Объект.СписокПроживающих.НайтиСтроки(Отбор);
		
		Если СтрокаТабличнойЧасти.Количество() = 0 Тогда
			
			ДобавитьСтрокуВСписокПроживающихНаСервере(ЭлементМассива);	
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// БИТ_ЖКХ 13.10.2011 Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

&НаСервере
Процедура ПроверитьНомерДокументаНаСервере()
	
	// БИТ_ЖКХ_09122013_начало_изменений
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.бит_РегистрацияПроживающихПоЛС"));
	
	бит_РаботаСДиалогамиСервер.ПроверитьНомерДокумента(ДокументОбъект, мКэшЗначений.Дата);
	
	ЗначениеВДанныеФормы(ДокументОбъект,Объект);
	// БИТ_ЖКХ_09122013_окончание_изменений
	
КонецПроцедуры

// БИТ_ЖКХ 18.07.2014
&НаКлиенте
Процедура СписокПроживающихСтатусПроживанияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПеречисления = Новый СписокЗначений;
	
	ТекущиеДанные = Элементы.СписокПроживающих.ТекущиеДанные;
	
	ПроживаниеВДанныйМомент = ПроживаниеВДанныйМоментНаСервере(ТекущиеДанные.СтатусФизЛица);
	
	Если ПроживаниеВДанныйМомент Тогда
		
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Временно"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Постоянно"));
		
		ВыбранныйЭлемент = Неопределено;
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СписокПроживающихСтатусПроживанияНачалоВыбораЗавершение1", ЭтотОбъект, Новый Структура("ПроживаниеВДанныйМомент, СписокПеречисления, ТекущиеДанные", ПроживаниеВДанныйМомент, СписокПеречисления, ТекущиеДанные)), СписокПеречисления, Элементы.СписокПроживающихСтатусПроживания);
		Возврат;
		
	ИначеЕсли Не ПроживаниеВДанныйМомент Тогда
		
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Временно"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.Постоянно"));
		СписокПеречисления.Добавить(ПредопределенноеЗначение("Перечисление.бит_СтатусПроживания.НеПроживает"));
		
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СписокПроживающихСтатусПроживанияНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ТекущиеДанные", ТекущиеДанные)), СписокПеречисления, Элементы.СписокПроживающихСтатусПроживания);
		Возврат;
		
	КонецЕсли;	
	
	СписокПроживающихСтатусПроживанияНачалоВыбораФрагмент1(ВыбранныйЭлемент, ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихСтатусПроживанияНачалоВыбораЗавершение1(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ПроживаниеВДанныйМомент = ДополнительныеПараметры.ПроживаниеВДанныйМомент;
	СписокПеречисления = ДополнительныеПараметры.СписокПеречисления;
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	СписокПроживающихСтатусПроживанияНачалоВыбораФрагмент1(ВыбранныйЭлемент, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихСтатусПроживанияНачалоВыбораФрагмент1(Знач ВыбранныйЭлемент, Знач ТекущиеДанные)
	
	СписокПроживающихСтатусПроживанияНачалоВыбораФрагмент(ВыбранныйЭлемент, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихСтатусПроживанияНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	ВыбранныйЭлемент = ВыбранныйЭлемент1;
	
	СписокПроживающихСтатусПроживанияНачалоВыбораФрагмент(ВыбранныйЭлемент, ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихСтатусПроживанияНачалоВыбораФрагмент(Знач ВыбранныйЭлемент, Знач ТекущиеДанные)
	
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		ТекущиеДанные.СтатусПроживания = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроживаниеВДанныйМоментНаСервере(СтатусФизЛица)
	
	Возврат СтатусФизЛица.ПроживаниеВДанныйМомент;
	
КонецФункции

&НаКлиенте
Процедура СписокПроживающихСтатусФизЛицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.СписокПроживающих.ТекущиеДанные;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СтатусПроживания",ТекущиеДанные.СтатусПроживания);
	
	ОткрытьФорму("Справочник.бит_СтатусФизЛица.Форма.ФормаВыбораУправляемая",Новый Структура("ОткрытьИзРегистрацииПроживающих",ПараметрыФормы),Элемент);
	
КонецПроцедуры
// БИТ_ЖКХ 18.07.2014

// БИТ_ЖКХ 10.09.2014
&НаКлиенте
Процедура СкопироватьПроживающего(Команда)
	
	Если Объект.СписокПроживающих.Количество() > 0 Тогда
		ТекСтрока = Элементы.СписокПроживающих.ТекущиеДанные;
		
		НоваяСтрока = Объект.СписокПроживающих.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
	КонецЕсли;
	
КонецПроцедуры
// БИТ_ЖКХ 10.09.2014

// БИТ_ЖКХ 23.09.2014
&НаКлиенте
Процедура СписокПроживающихСтатусФизЛицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокПроживающих.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекСтрока.ДатаСнятияСРегистрации) и Элемент.ТекстРедактирования = "Удален с лицевого счета" Тогда
		Если Объект.Дата > ТекСтрока.ДатаСнятияСРегистрации Тогда
			
			СтандартнаяОбработка = Ложь;
			Возврат;
			
		КонецЕсли;	 
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихДатаПраваСобственностиОткрытие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихДатаПраваСобственностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихДатаПраваСобственностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	если ПроверитьДатуСобственников(ВыбранноеЗначение) = ложь тогда
	  Сообщить("За эту дату уже имеется владелец");	
	  ВыбранноеЗначение = '00010101000000';
	  УстановитьДатуНаСервере(ВыбранноеЗначение);
	конецесли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуНаСервере(ВыбранноеЗначение)
 объект.СписокПроживающих[0].ДатаПраваСобственности = неопределено;		
КонецПроцедуры


// БИТ ЖКХ 08.04.2020
&НаСервере
Процедура СписокПроживающихПриАктивизацииСтрокиНаСервере(СтепеньРодства)
	//если мКэшЗначений.НачислениеСоДняПраваСобственности = истина и
	если СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда      		
		ЭтаФорма.Элементы.СписокПроживающихДатаПраваСобственности.Доступность = истина;		
	иначе
	    ЭтаФорма.Элементы.СписокПроживающихДатаПраваСобственности.Доступность = ложь;		
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихПриАктивизацииСтроки(Элемент)
  // БИТ ЖКХ 09.04.2020
  если Элемент.ТекущиеДанные <> неопределено тогда 	
	СписокПроживающихПриАктивизацииСтрокиНаСервере(Элемент.ТекущиеДанные.СтепеньРодства);
  конецесли;	
КонецПроцедуры

// БИТ ЖКХ 13.04.2020
&НаСервере
Процедура СписокПроживающихСтепеньРодстваПриИзмененииНаСервере(СтепеньРодства)
	//если мКэшЗначений.НачислениеСоДняПраваСобственности = истина и
	если СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо тогда      		
		//ЗаполнитьТаблицуСобственников();   
		ЭтаФорма.Элементы.СписокПроживающихДатаПраваСобственности.Доступность = истина;		
		СписокПроживающихДатаПраваСобственности = ЗаполнитьТаблицуСобственников();
	иначе
	   	СписокПроживающихДатаПраваСобственности = неопределено;
		УстановитьДатуНаСервере(неопределено);
		ЭтаФорма.Элементы.СписокПроживающихДатаПраваСобственности.Доступность = ложь;		
	конецесли;

КонецПроцедуры

функция ПолучитьДатуПоследнегоСобственника()
	
Конецфункции	

&НаКлиенте
Процедура СписокПроживающихСтепеньРодстваПриИзменении(Элемент)
  если ТекущийЭлемент <> неопределено и
		  ТекущийЭлемент.ТекущиеДанные <> неопределено тогда
	 СписокПроживающихСтепеньРодстваПриИзмененииНаСервере(ТекущийЭлемент.ТекущиеДанные.СтепеньРодства);
	 
	 ТекущийЭлемент.ТекущиеДанные.ДатаПраваСобственности = ЗаполнитьТаблицуСобственников(ТекущийЭлемент.ТекущиеДанные.СтепеньРодства); 
  конецесли; 
КонецПроцедуры

&НаСервере
Процедура СписокПроживающихПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихПриИзменении(Элемент)
	СписокПроживающихПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокПроживающихОбработкаВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СписокПроживающихОбработкаВыбораНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СписокПроживающихВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокПроживающихВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СписокПроживающихВыборНаСервере();
КонецПроцедуры

// +bit ISedakova ЛТ 94
&НаКлиенте
Процедура бит_ПодборПроживающихПоКвартире(Команда)
	бит_ПодборПроживающихПоКвартиреНаСервере();
КонецПроцедуры

&НаСервере
Процедура бит_ПодборПроживающихПоКвартиреНаСервере()
	
		Объект.СписокПроживающих.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ПроживающиеПоЛССрезПоследних.ФизЛицо.ДатаРождения КАК ДатаРождения,
		|	ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
		|	ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
		|	ПроживающиеПоЛССрезПоследних.СтатусФизЛица КАК СтатусФизЛица,
		|	ПроживающиеПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
		|	ПроживающиеПоЛССрезПоследних.СтатусПроживания КАК СтатусПроживания,
		|	ПроживающиеПоЛССрезПоследних.ДатаРегистрации КАК ДатаРегистрации,
		|	ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации КАК ДатаСнятияСРегистрации,
		|	ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
		|	ПроживающиеПоЛССрезПоследних.ВладелецКвартиры КАК ВладелецКвартиры,
		|	ПроживающиеПоЛССрезПоследних.ПричинаВыписки КАК ПричинаВыписки,
		|	ПроживающиеПоЛССрезПоследних.ПричинаПрописки КАК ПричинаПрописки,
		|	ПроживающиеПоЛССрезПоследних.КудаВыписан КАК КудаВыписан,
		|	ПроживающиеПоЛССрезПоследних.ОткудаПрибыл КАК ОткудаПрибыл,
		|	ПроживающиеПоЛССрезПоследних.ДоляПлощади КАК ДоляПлощади,
		//|	ПроживающиеПоЛССрезПоследних.ПравоустанавливающиеДокументы КАК ПравоустанавливающиеДокументы,
		|	ПроживающиеПоЛССрезПоследних.СтатусФизЛицаДляИзменения КАК СтатусФизЛицаДляИзменения,
		|	ПроживающиеПоЛССрезПоследних.ДатаПрибытия КАК ДатаПрибытия,
		|	ПроживающиеПоЛССрезПоследних.лб_ДоляПлощадиСтрокой КАК лб_ДоляПлощадиСтрокой,
		|	ПроживающиеПоЛССрезПоследних.лб_СтрокаРодствДляФЛС КАК лб_СтрокаРодствДляФЛС,
		|	ПроживающиеПоЛССрезПоследних.лб_ИгнорироватьПериодВКопииФЛС КАК лб_ИгнорироватьПериодВКопииФЛС,
		|	ПроживающиеПоЛССрезПоследних.лб_ДатаРегистрацииДляФЛС КАК лб_ДатаРегистрацииДляФЛС,
		|	ПроживающиеПоЛССрезПоследних.лб_ДатаВыпискиДляФЛС КАК лб_ДатаВыпискиДляФЛС,
		|	ПроживающиеПоЛССрезПоследних.бит_ПомещенВАрхив КАК ПомещенВАрхив,
		|	ПроживающиеПоЛССрезПоследних.ДатаПраваСобственности КАК ДатаПраваСобственности,
		|	ПроживающиеПоЛССрезПоследних.бит_ВПечать КАК бит_ВПечать
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(
		|			&Момент,
		|			ЛицевойСчет = &ЛицевойСчет
		|				И НЕ лб_ИгнорироватьПериодВКопииФЛС) КАК ПроживающиеПоЛССрезПоследних";
		
		Запрос.УстановитьПараметр("ЛицевойСчет", Объект.ЛицевойСчет);
		Запрос.УстановитьПараметр("Момент", ТекущаяДата());
		Запрос.УстановитьПараметр("СтатусФизЛица", Справочники.бит_СтатусФизЛица.НайтиПоКоду("000000003"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если Не ВыборкаДетальныеЗаписи.ПомещенВАрхив Тогда
				НоваяСтрока = Объект.СписокПроживающих.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);	
			КонецЕсли; 
			
		КонецЦикла;
		
КонецПроцедуры
// -bit ISedakova 

//&НаСервере
//Процедура СписокПроживающихПриАктивизацииЯчейкиНаСервере(СтепеньРодства)
//	родство = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо;
//	
//	если СтепеньРодства = родство тогда      		
//		ЭтотОбъект.ТекущийЭлемент.ТекущийЭлемент.Доступность = истина;		
//	иначе
//	    ЭтотОбъект.ТекущийЭлемент.ТекущийЭлемент.Доступность = ложь;		
//	конецесли;	
//	// Вставить содержимое обработчика.
//КонецПроцедуры
// БИТ_ЖКХ 23.09.2014

#КонецОбласти
